
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>百度搜索Mobile Friendly（移动友好度）标准V1.0 · Web 开发手册</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-atoc/atoc.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="website-optimization.html" />
    
    
    <link rel="prev" href="search-engine-principle.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    前端技术
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../web-tech/fis.html">
            
                <a href="../web-tech/fis.html">
            
                    
                    使用 FIS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../web-tech/use-mip-to-create-mobile-web-pages.html">
            
                <a href="../web-tech/use-mip-to-create-mobile-web-pages.html">
            
                    
                    MIP-移动页面加速器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="../web-tech/lavas-pwa.html">
            
                <a href="../web-tech/lavas-pwa.html">
            
                    
                    Lavas PWA-渐进式应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" >
            
                <span>
            
                    
                    建站安全
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1.1" data-path="../security/https-pratice-1.html">
            
                <a href="../security/https-pratice-1.html">
            
                    
                    大型网站的HTTPS实践（一）-- HTTPS协议和原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.2" data-path="../security/https-pratice-2.html">
            
                <a href="../security/https-pratice-2.html">
            
                    
                    大型网站的HTTPS实践（二）-- HTTPS对性能的影响
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.3" data-path="../security/https-pratice-3.html">
            
                <a href="../security/https-pratice-3.html">
            
                    
                    大型网站的HTTPS实践（三）-- 基于协议和配置的优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.4" data-path="../security/https-pratice-4.html">
            
                <a href="../security/https-pratice-4.html">
            
                    
                    大型网站的HTTPS实践（四）-- 协议层以外的实践[1]
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.5" data-path="../security/https-faq.html">
            
                <a href="../security/https-faq.html">
            
                    
                    HTTPS常见问题解答
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" >
            
                <span>
            
                    
                    SEO
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="4.1.1" data-path="search-engine-principle.html">
            
                <a href="search-engine-principle.html">
            
                    
                    百度搜索引擎工作原理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.1.2" data-path="mobile-friendly-standard.html">
            
                <a href="mobile-friendly-standard.html">
            
                    
                    百度搜索Mobile Friendly（移动友好度）标准V1.0
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.3" data-path="website-optimization.html">
            
                <a href="website-optimization.html">
            
                    
                    网站优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.4" data-path="website-development.html">
            
                <a href="website-development.html">
            
                    
                    网站建设
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >百度搜索Mobile Friendly（移动友好度）标准V1.0</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x767E;&#x5EA6;&#x641C;&#x7D22;mobile-friendly&#xFF08;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#xFF09;&#x6807;&#x51C6;v10">&#x767E;&#x5EA6;&#x641C;&#x7D22;Mobile Friendly&#xFF08;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#xFF09;&#x6807;&#x51C6;V1.0</h1>
<p>&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x662F;&#x5168;&#x7403;&#x6700;&#x5927;&#x7684;&#x4E2D;&#x6587;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3002;&#x5728;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x65F6;&#x4EE3;&#xFF0C;&#x767E;&#x5EA6;&#x6BCF;&#x5929;&#x54CD;&#x5E94;&#x79FB;&#x52A8;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x9AD8;&#x8FBE;&#x51E0;&#x5341;&#x4EBF;&#x6B21;&#xFF0C;&#x5BFC;&#x5411;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6D41;&#x91CF;&#x51E0;&#x5341;&#x4EBF;&#x91CF;&#x7EA7;&#xFF0C;&#x4E14;&#x5FEB;&#x901F;&#x589E;&#x957F;&#x3002;&#x9762;&#x5BF9;&#x79FB;&#x52A8;&#x7528;&#x6237;&#x7684;&#x8FC5;&#x731B;&#x5D1B;&#x8D77;&#xFF0C;&#x7AD9;&#x957F;&#x4EEC;&#x7EB7;&#x7EB7;&#x6D8C;&#x5165;&#x79FB;&#x52A8;&#x5316;&#x5EFA;&#x8BBE;&#x7684;&#x6D6A;&#x6F6E;&#x4E2D;&#x3002;&#x767E;&#x5EA6;&#x79C9;&#x627F;<code>&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x81F3;&#x4E0A;</code>&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x4EE5;&#x79FB;&#x52A8;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x4E3A;&#x5BFC;&#x5411;&#xFF0C;&#x53D1;&#x5E03;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x6807;&#x51C6;&#xFF0C;&#x65E8;&#x5728;&#x5E2E;&#x52A9;&#x7AD9;&#x957F;&#x5EFA;&#x7ACB;&#x9002;&#x5408;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x5E94;&#x7528;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x4E3A;&#x7F51;&#x7AD9;&#x79FB;&#x52A8;&#x5316;&#x5EFA;&#x8BBE;&#x63D0;&#x4F9B;&#x660E;&#x786E;&#x7684;&#x65B9;&#x5411;&#x3002;&#x672C;&#x6B21;&#x62DF;&#x5148;&#x53D1;&#x5E03;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x6807;&#x51C6;V1.0&#x7248;&#xFF0C;&#x540E;&#x7EED;&#x4F1A;&#x4E0D;&#x65AD;&#x6536;&#x96C6;&#x7AD9;&#x957F;&#x53CD;&#x9988;&#x5E76;&#x5C3D;&#x5FEB;&#x53D1;&#x5E03;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x5F00;&#x53D1;&#x6307;&#x5357;&#xFF0C;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x89C4;&#x8303;&#x5E76;&#x6307;&#x5BFC;&#x79FB;&#x52A8;&#x5EFA;&#x7AD9;&#x3002;       </p>
<h2 id="&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x6982;&#x8FF0;">&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x6982;&#x8FF0;</h2>
<p>&#x5F53;&#x7528;&#x6237;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x70B9;&#x6309;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x65F6;&#xFF0C;&#x9664;&#x4E86;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5BF9;&#x9700;&#x6C42;&#x7684;&#x6EE1;&#x8DB3;&#x7A0B;&#x5EA6;&#x5916;&#xFF0C;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x7684;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x3001;&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x3001;&#x8D44;&#x6E90;&#x6216;&#x529F;&#x80FD;&#x7684;&#x6613;&#x7528;&#x6027;&#x3001;&#x9875;&#x9762;&#x662F;&#x5426;&#x7B26;&#x5408;&#x79FB;&#x52A8;&#x7AEF;&#x9002;&#x914D;&#x7B49;&#xFF0C;&#x90FD;&#x5F71;&#x54CD;&#x79FB;&#x52A8;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x6EE1;&#x610F;&#x5EA6;&#x3002;&#x767E;&#x5EA6;&#x81F4;&#x529B;&#x4E8E;&#x5E2E;&#x52A9;&#x79FB;&#x52A8;&#x7528;&#x6237;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x79FB;&#x52A8;&#x9875;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#xFF0C;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8BC4;&#x4EF7;&#x56E0;&#x5B50;&#x3002;       </p>
<p>&#x8FD9;&#x4EFD;&#x6807;&#x51C6;&#x65E8;&#x5728;&#x544A;&#x8BC9;&#x5E7F;&#x5927;&#x7AD9;&#x957F;&#xFF0C;&#x600E;&#x6837;&#x7684;&#x79FB;&#x52A8;&#x9875;&#x662F;&#x53D7;&#x7528;&#x6237;&#x6B22;&#x8FCE;&#x7684;&#xFF0C;&#x4E0D;&#x4EC5;&#x9488;&#x5BF9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF0C;&#x767E;&#x5EA6;&#x66F4;&#x9F13;&#x52B1;&#x7AD9;&#x957F;&#x4ECE;&#x7528;&#x6237;&#x89D2;&#x5EA6;&#x6765;&#x5EFA;&#x8BBE;&#x7F51;&#x9875;&#x3002;       </p>
<h2 id="&#x9762;&#x5411;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#xFF1A;&#x9875;&#x9762;&#x53EF;&#x8BFB;&#x6027;">&#x9762;&#x5411;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#xFF1A;&#x9875;&#x9762;&#x53EF;&#x8BFB;&#x6027;</h2>
<p>&#x4E0D;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x9875;&#x9762;&#x4F1A;&#x88AB;&#x76F4;&#x63A5;&#x5F52;&#x5165;&#x5783;&#x573E;&#x9875;&#x9762;&#xFF0C;&#x767E;&#x5EA6;&#x4E0D;&#x4F1A;&#x6D6A;&#x8D39;&#x8D44;&#x6E90;&#x5BF9;&#x5783;&#x573E;&#x9875;&#x9762;&#x8FDB;&#x884C;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x8BC4;&#x4F30;&#x3002;&#x9875;&#x9762;&#x53EF;&#x8BFB;&#x662F;&#x8861;&#x91CF;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x7684;&#x57FA;&#x7840;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x9875;&#x9762;&#x53EF;&#x8BFB;&#x4E3B;&#x8981;&#x6307;&#x7528;&#x6237;&#x53EF;&#x8BFB;&#xFF0C;&#x5373;&#x7528;&#x6237;&#x80FD;&#x591F;&#x770B;&#x89C1;&#x3001;&#x770B;&#x6E05;&#x5E76;&#x770B;&#x61C2;&#x9875;&#x9762;&#x3002;&#x9875;&#x9762;&#x53EF;&#x8BFB;&#x6027;&#x5305;&#x542B;&#x5982;&#x4E0B;&#x7EF4;&#x5EA6;&#xFF1A;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x4F53;&#x9A8C;&#x3001;&#x9875;&#x9762;&#x7ED3;&#x6784;&#x3001;&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x3002;   </p>
<h2 id="&#x3010;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x4F53;&#x9A8C;&#x3011;">&#x3010;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x4F53;&#x9A8C;&#x3011;</h2>
<p>&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#xFF0C;&#x7F51;&#x9875;&#x7684;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x5BF9;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x5F71;&#x54CD;&#x65E5;&#x8D8B;&#x660E;&#x663E;&#x3002;&#x767E;&#x5EA6;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x90E8;&#x7814;&#x7A76;&#x8868;&#x660E;&#xFF0C;&#x7528;&#x6237;&#x671F;&#x671B;&#x4E14;&#x80FD;&#x591F;&#x63A5;&#x53D7;&#x7684;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x5728;3&#x79D2;&#x4EE5;&#x5185;&#x3002;&#x82E5;&#x9875;&#x9762;&#x7684;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x8D85;&#x8FC7;5&#x79D2;&#xFF0C;78%&#x7684;&#x7528;&#x6237;&#x4F1A;&#x5931;&#x53BB;&#x8010;&#x5FC3;&#x800C;&#x9009;&#x62E9;&#x79BB;&#x5F00;&#x3002;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x662F;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x4E2D;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6392;&#x5E8F;&#x56E0;&#x7D20;&#xFF0C;&#x767E;&#x5EA6;&#x518D;&#x6B21;&#x5EFA;&#x8BAE;&#x7AD9;&#x957F;&#x5BF9;&#x8FD9;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x4E13;&#x9879;&#x4F18;&#x5316;&#x3002;   </p>
<h2 id="&#x3010;&#x9875;&#x9762;&#x7ED3;&#x6784;&#x3011;">&#x3010;&#x9875;&#x9762;&#x7ED3;&#x6784;&#x3011;</h2>
<p>&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F18;&#x8D28;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x8981;&#x8BA9;&#x7528;&#x6237;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x5230;&#x9875;&#x9762;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#xFF0C;&#x83B7;&#x53D6;&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x4FE1;&#x606F;&#x65F6;&#x6CA1;&#x6709;&#x591A;&#x4F59;&#x7684;&#x5E72;&#x6270;&#xFF0C;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x6240;&#x9700;&#x3002;&#x7528;&#x6237;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x7ED3;&#x6784;&#xFF0C;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x9875;&#x9762;&#x5404;&#x6A21;&#x5757;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F18;&#x8D28;&#x7684;&#x79FB;&#x52A8;&#x9875;&#x9700;&#x5173;&#x6CE8;2&#x70B9;&#xFF1A;   </p>
<ol>
<li><p>&#x57FA;&#x672C;&#x5730;&#xFF0C;&#x9875;&#x9762;&#x80FD;&#x591F;&#x6839;&#x636E;&#x5C4F;&#x5E55;&#x8C03;&#x6574;&#x5185;&#x5BB9;&#x5927;&#x5C0F;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x9700;&#x8981;&#x5DE6;&#x53F3;&#x6EDA;&#x52A8;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7F29;&#x653E;&#x64CD;&#x4F5C;&#x5C31;&#x80FD;&#x6E05;&#x6670;&#x8FA8;&#x8BC6;&#x7F51;&#x9875;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
</li>
<li><p>&#x5176;&#x6B21;&#xFF0C;&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x4F4D;&#x4E8E;&#x9996;&#x5C4F;&#x4E14;&#x4E2D;&#x5FC3;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5176;&#x4ED6;&#x76F8;&#x5173;&#x5EA6;&#x4F4E;&#x7684;&#x5185;&#x5BB9;&#x5BF9;&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x65E0;&#x5E72;&#x6270;&#x4F5C;&#x7528;&#x3002;&#x767E;&#x5EA6;&#x4F1A;&#x4E25;&#x5389;&#x6253;&#x51FB;&#x5E94;&#x7528;&#x6076;&#x610F;&#x5F39;&#x7A97;/&#x6D6E;&#x5C42;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x89C6;&#x5BF9;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x9020;&#x6210;&#x4F24;&#x5BB3;&#x7A0B;&#x5EA6;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5728;&#x7ED3;&#x679C;&#x6392;&#x5E8F;&#x4E0A;&#x4F1A;&#x5BF9;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#x51CF;&#x5206;&#xFF1A;&#x5E7F;&#x544A;&#x906E;&#x76D6;&#x4E3B;&#x4F53;&#x3001;&#x5E7F;&#x544A;&#x52A8;&#x6001;&#x62A2;&#x593A;&#x7528;&#x6237;&#x89C6;&#x7EBF;&#x3001;&#x5E7F;&#x544A;&#x7A7F;&#x63D2;&#x4E3B;&#x4F53;&#x7B49;&#x3002;   </p>
</li>
</ol>
<p>&#x9875;&#x9762;&#x7ED3;&#x6784;&#x76F8;&#x5173;&#x793A;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;   </p>
<p><img src="img/seo_1.png" alt="">
<img src="img/seo_2.png" alt=""></p>
<h2 id="&#x3010;&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x3011;">&#x3010;&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x3011;</h2>
<p>&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x548C;&#x9875;&#x9762;&#x7ED3;&#x6784;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF1A;&#x9875;&#x9762;&#x7ED3;&#x6784;&#x5DEE;&#xFF0C;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x3002;&#x9875;&#x9762;&#x7ED3;&#x6784;&#x4F18;&#x8D28;&#xFF0C;&#x60F3;&#x7ED9;&#x7528;&#x6237;&#x66F4;&#x597D;&#x7684;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#xFF0C;&#x9996;&#x5148;&#x6CE8;&#x610F;&#xFF1A;    </p>
<ul>
<li>&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x6587;&#x672C;&#x5185;&#x5BB9;&#x548C;&#x80CC;&#x666F;&#x8272;&#x5E94;&#x6709;&#x660E;&#x663E;&#x7684;&#x533A;&#x5206;&#x5EA6;&#xFF1B;</li>
<li>&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x6587;&#x672C;&#x5185;&#x5BB9;&#x5E94;&#x6BB5;&#x843D;&#x5206;&#x660E;&#xFF0C;&#x6392;&#x7248;&#x7CBE;&#x826F;&#xFF1B;</li>
</ul>
<p>&#x767E;&#x5EA6;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x90E8;&#x5BF9;&#x79FB;&#x52A8;&#x9875;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x7684;&#x7814;&#x7A76;&#x6210;&#x679C;&#xFF1A;    </p>
<ol>
<li><p>&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x542B;&#x6587;&#x672C;&#x6BB5;&#x843D;&#x65F6;&#xFF0C;&#x6B63;&#x6587;&#x5B57;&#x53F7;&#x63A8;&#x8350;14px&#xFF0C;&#x884C;&#x95F4;&#x8DDD;&#x63A8;&#x8350;&#xFF08;0.42~0.6&#xFF09;<em>&#x5B57;&#x53F7;&#xFF0C;&#x6B63;&#x6587;&#x5B57;&#x53F7;&#x4E0D;&#x5C0F;&#x4E8E;10px&#xFF0C;&#x884C;&#x95F4;&#x8DDD;&#x4E0D;&#x5C0F;&#x4E8E;0.2</em>&#x5B57;&#x53F7;&#xFF1B;</p>
</li>
<li><p>&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x542B;&#x591A;&#x56FE;&#x65F6;&#xFF0C;&#x9664;&#x56FE;&#x7247;&#x8D28;&#x91CF;&#x5916;&#xFF0C;&#x5E94;&#x8BBE;&#x7F6E;&#x56FE;&#x7247;&#x5BBD;&#x5EA6;&#x4E00;&#x81F4;&#x4F4D;&#x7F6E;&#x7EDF;&#x4E00;&#xFF1B;</p>
</li>
<li><p>&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x542B;&#x591A;&#x4E2A;&#x6587;&#x5B57;&#x94FE;&#x65F6;&#xFF0C;&#x6587;&#x5B57;&#x94FE;&#x5B57;&#x53F7;&#x63A8;&#x8350;14px&#x6216;16px&#xFF1A;&#x5B57;&#x53F7;&#x4E3A;14px&#x65F6;&#xFF0C;&#x7EB5;&#x5411;&#x95F4;&#x8DDD;&#x63A8;&#x8350;13px&#xFF1B;&#x5B57;&#x53F7;&#x4E3A;16px&#x65F6;&#xFF0C;&#x7EB5;&#x5411;&#x95F4;&#x8DDD;&#x63A8;&#x8350;14px&#xFF1B;&#x6587;&#x5B57;&#x94FE;&#x6574;&#x4F53;&#x53EF;&#x70B9;&#x533A;&#x57DF;&#x4E0D;&#x5C0F;&#x4E8E;40px&#xFF1B;</p>
</li>
<li><p>&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x53EF;&#x70B9;&#x533A;&#x57DF;&#xFF0C;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x5E94;&#x5927;&#x4E8E;40px&#xFF1B;</p>
</li>
<li><p>&#x6B64;&#x5916;&#xFF0C;&#x9700;&#x6CE8;&#x610F;&#x4EA4;&#x4E92;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x540C;&#x4E00;&#x9875;&#x9762;&#x4E0D;&#x5E94;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x624B;&#x52BF;&#x5B8C;&#x6210;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x3002;</p>
</li>
</ol>
<p>&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x4F53;&#x9A8C;&#x76F8;&#x5173;&#x793A;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;   </p>
<p><img src="img/seo_3.png" alt="">
<img src="img/seo_4.png" alt=""></p>
<p>&#x9762;&#x5411;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#xFF1A;&#x8D44;&#x6E90;&#x6613;&#x7528;&#x6027;   </p>
<h2 id="&#x3010;&#x8D44;&#x6E90;&#x6613;&#x7528;&#x6027;&#x3011;">&#x3010;&#x8D44;&#x6E90;&#x6613;&#x7528;&#x6027;&#x3011;</h2>
<p>&#x6309;&#x7167;&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x8F7D;&#x4F53;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x8D44;&#x6E90;&#x6613;&#x7528;&#x6027;&#x7684;&#x6807;&#x51C6;&#x4F1A;&#x6709;&#x8F83;&#x5927;&#x7684;&#x4E0D;&#x540C;&#xFF1A;   </p>
<ol>
<li><p>&#x9996;&#x9875;&#x6216;&#x7D22;&#x5F15;&#x9875;&#xFF1A;&#x9875;&#x9762;&#x63D0;&#x4F9B;&#x7684;&#x5BFC;&#x822A;&#x94FE;&#x63A5;&#x5E94;&#x6E05;&#x6670;&#x53EF;&#x70B9;&#xFF0C;&#x9875;&#x9762;&#x63A8;&#x8350;&#x7684;&#x5185;&#x5BB9;&#x5E94;&#x6E05;&#x6670;&#x6709;&#x6548;&#xFF1B;</p>
</li>
<li><p>&#x6587;&#x672C;&#x9875;&#x9762;&#xFF1A;&#x9875;&#x9762;&#x63D0;&#x4F9B;&#x7684;&#x5185;&#x5BB9;&#x5E94;&#x6E05;&#x6670;&#x5B8C;&#x6574;&#xFF0C;&#x6709;&#x7CBE;&#x826F;&#x7684;&#x6392;&#x7248;&#x3002;&#x6587;&#x672C;&#x9875;&#x9762;&#x5305;&#x62EC;&#x6587;&#x7AE0;&#x9875;. &#x95EE;&#x7B54;&#x9875;. &#x8BBA;&#x575B;&#x9875;&#x7B49;&#x3002;</p>
</li>
<li><p>Flash&#xFF1A;Flash &#x662F;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E0A;&#x4E0D;&#x5E38;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x5F62;&#x5F0F;&#xFF0C;&#x5E94;&#x907F;&#x514D;&#x4F7F;&#x7528;&#xFF1B;</p>
</li>
<li><p>&#x97F3;/&#x89C6;&#x9891;&#x9875;&#xFF1A;&#x97F3;/&#x89C6;&#x9891;&#x5E94;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x64AD;&#x653E;&#xFF0C;&#x4E14;&#x8D44;&#x6E90;&#x6E05;&#x6670;&#x4F18;&#x8D28;&#x3002;&#x767E;&#x5EA6;&#x4E25;&#x5389;&#x6253;&#x51FB;&#x6B3A;&#x8BC8;&#x6027;&#x4E0B;&#x8F7D;&#x64AD;&#x653E;&#x5668;&#x7684;&#x884C;&#x4E3A;&#xFF1B;</p>
</li>
<li><p>APP&#x4E0B;&#x8F7D;&#xFF1A;APP&#x5E94;&#x63D0;&#x4F9B;&#x76F4;&#x63A5;&#x4E0B;&#x8F7D;&#xFF0C;&#x4E14;&#x4E0B;&#x8F7D;&#x7684;&#x4E3A;&#x6700;&#x4F73;&#x7248;&#x672C;&#xFF1B;&#x767E;&#x5EA6;&#x4E25;&#x5389;&#x6253;&#x51FB;&#x6B3A;&#x8BC8;&#x6027;&#x4E0B;&#x8F7D;&#x624B;&#x673A;&#x52A9;&#x624B;&#x548C;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x7684;&#x884C;&#x4E3A;&#xFF1B;</p>
</li>
<li><p>&#x6587;&#x6863;&#x9875;&#xFF1A;&#x5E94;&#x63D0;&#x4F9B;&#x53EF;&#x76F4;&#x63A5;&#x9605;&#x8BFB;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x4E14;&#x6587;&#x6863;&#x9605;&#x8BFB;&#x4F53;&#x9A8C;&#x597D;&#xFF1B;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5C06;&#x6587;&#x6863;&#x8D44;&#x6E90;&#x8F6C;&#x5316;&#x4E3A;&#x56FE;&#x7247;&#x8D44;&#x6E90;&#x7684;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x4EC5;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5BF9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4E5F;&#x4E0D;&#x53CB;&#x597D;&#xFF0C;&#x5E94;&#x907F;&#x514D;&#x3002;</p>
</li>
<li><p>&#x670D;&#x52A1;&#x9875;&amp;&#x529F;&#x80FD;&#x9875;&#xFF1A;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x6216;&#x529F;&#x80FD;&#x5E94;&#x6613;&#x7528;&#x597D;&#x7528;&#xFF0C;&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x3002;</p>
</li>
</ol>
<p>&#x9762;&#x5411;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#xFF1A;&#x529F;&#x80FD;&#x6613;&#x7528;&#x6027;</p>
<h2 id="&#x3010;&#x529F;&#x80FD;&#x6613;&#x7528;&#x6027;&#x3011;">&#x3010;&#x529F;&#x80FD;&#x6613;&#x7528;&#x6027;&#x3011;</h2>
<p>&#x6309;&#x7167;&#x9875;&#x9762;&#x4E3B;&#x4F53;&#x529F;&#x80FD;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x529F;&#x80FD;&#x6613;&#x7528;&#x6027;&#x7684;&#x8003;&#x91CF;&#x533A;&#x522B;&#x5982;&#x4E0B;&#xFF1A;     </p>
<ol>
<li><p>&#x5546;&#x54C1;&#x9875;&#xFF1A;&#x9875;&#x9762;&#x5E94;&#x63D0;&#x4F9B;&#x5B8C;&#x6574;&#x7684;&#x5546;&#x54C1;&#x4FE1;&#x606F;&#x548C;&#x6709;&#x6548;&#x5730;&#x8D2D;&#x4E70;&#x8DEF;&#x5F84;&#x3002;</p>
</li>
<li><p>&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x9875;&#xFF1A;&#x9875;&#x9762;&#x7F57;&#x5217;&#x51FA;&#x7684;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5E94;&#x4E0E;&#x641C;&#x7D22;&#x8BCD;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;</p>
</li>
<li><p>&#x8868;&#x5355;&#x9875;&#xFF1A;&#x9875;&#x9762;&#x5E94;&#x63D0;&#x4F9B;&#x5B8C;&#x6574;&#x6709;&#x6548;&#x7684;&#x529F;&#x80FD;&#x3002;&#x8868;&#x5355;&#x9875;&#x4E3B;&#x8981;&#x6307;&#x6CE8;&#x518C;&#x9875;&#x3001;&#x767B;&#x9646;&#x9875;&#x3001;&#x4FE1;&#x606F;&#x63D0;&#x4EA4;&#x9875;&#x7B49;&#x3002;</p>
</li>
</ol>
<p>&#x8D44;&#x6E90;&#x53CA;&#x529F;&#x80FD;&#x6613;&#x7528;&#x6027;&#x76F8;&#x5173;&#x793A;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;    </p>
<p><img src="img/seo_5.png" alt="">                                             </p>
<p> &#x56FE;1.&#x8D44;&#x6E90;&#x6613;&#x7528;&#x6027;-Flash&#x4E0D;&#x53EF;&#x7528;  </p>
<p><strong>&#x9762;&#x5411;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#xFF1A;&#x4F53;&#x9A8C;&#x589E;&#x76CA;&#x6027;</strong></p>
<p>&#x8FD9;&#x4E2A;&#x7EF4;&#x5EA6;&#x5C5E;&#x4E8E;&#x589E;&#x76CA;&#x9879;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x9875;&#x9762;&#x5728;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x8D44;&#x6E90;&#x53CA;&#x529F;&#x80FD;&#x6613;&#x7528;&#x6027;&#x4E0A;&#x8868;&#x73B0;&#x8F83;&#x597D;&#x65F6;&#xFF0C;&#x767E;&#x5EA6;&#x6392;&#x5E8F;&#x65F6;&#x624D;&#x4F1A;&#x8003;&#x8651;&#x4F53;&#x9A8C;&#x589E;&#x76CA;&#x6027;&#xFF0C;&#x5E76;&#x7ED9;&#x4E88;&#x989D;&#x5916;&#x7684;&#x4F18;&#x5F85;&#xFF1A;    </p>
<ol>
<li><p>&#x63D0;&#x4F9B;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;&#x589E;&#x76CA;&#xFF0C;&#x4F8B;&#x5982;&#x9875;&#x9762;&#x63D0;&#x4F9B;&#x6709;&#x6548;&#x7684;&#x5BFC;&#x822A;&#x6216;&#x9762;&#x5305;&#x5C51;&#xFF08;My post&#xFF09;&#xFF0C;&#x80FD;&#x591F;&#x53BB;&#x5F80;&#x4E0A;&#x4E00;&#x7EA7;&#x6216;&#x4E0B;&#x4E00;&#x7EA7;&#x9875;&#x9762;&#xFF1B;</p>
</li>
<li><p>&#x751F;&#x6D3B;&#x670D;&#x52A1;&#x7C7B;&#x7F51;&#x7AD9;&#xFF0C;&#x63D0;&#x4F9B;&#x6548;&#x7387;&#x4E0A;&#x7684;&#x589E;&#x76CA;&#xFF0C;&#x4F8B;&#x5982;&#x7535;&#x8BDD;&#x53EF;&#x62E8;&#x6253;&#x3001;&#x5730;&#x5740;&#x53EF;&#x5B9A;&#x4F4D;&#xFF1B;</p>
</li>
<li><p>&#x67E5;&#x8BE2;&#x7C7B;&#x7F51;&#x7AD9;&#xFF0C;&#x63D0;&#x4F9B;&#x8F93;&#x5165;&#x65B9;&#x5F0F;&#x4E0A;&#x7684;&#x589E;&#x76CA;&#xFF0C;&#x4F8B;&#x5982;&#x652F;&#x6301;&#x8BED;&#x97F3;&#x8F93;&#x5165;&#x3001;&#x56FE;&#x50CF;&#x8F93;&#x5165;&#x3001;&#x626B;&#x7801;&#x529F;&#x80FD;&#x7B49;&#xFF1B;</p>
</li>
<li><p>&#x9605;&#x8BFB;&#x7C7B;&#x7F51;&#x7AD9;&#xFF0C;&#x63D0;&#x4F9B;&#x4F53;&#x9A8C;&#x589E;&#x76CA;&#xFF0C;&#x4F8B;&#x5982;&#x591C;&#x95F4;&#x6A21;&#x5F0F;&#x7B49;&#x3002;</p>
</li>
</ol>
<p>&#x4F53;&#x9A8C;&#x589E;&#x76CA;&#x6027;&#x76F8;&#x5173;&#x793A;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;   </p>
<p><img src="img/seo_6.png" alt=""><br> <img src="img/seo_7.png" alt="">     </p>
<p>&#x5728;&#x79FB;&#x52A8;&#x7AEF;&#xFF0C;APP&#x81EA;&#x8C03;&#x8D77;&#x672A;&#x5224;&#x65AD;&#x7528;&#x6237;&#x9700;&#x6C42;&#x72B6;&#x6001;&#x5373;&#x5207;&#x65AD;&#x641C;&#x7D22;&#x6D41;&#x7A0B;&#xFF0C;&#x7834;&#x574F;&#x4E86;&#x641C;&#x7D22;&#x4F53;&#x9A8C;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x6D41;&#x7545;&#x6027;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x5BF9;&#x70B9;&#x51FB;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x540E;&#x7684;&#x6548;&#x679C;&#x6CA1;&#x6709;&#x9884;&#x671F;&#xFF0C;&#x5EFA;&#x8BAE;&#x7AD9;&#x957F;&#x4F7F;&#x7528;Applink&#x670D;&#x52A1;&#x5E76;&#x5B89;&#x88C5;&#x76F8;&#x5E94;&#x7684;SDK&#xFF0C;&#x4FDD;&#x969C;&#x7528;&#x6237;&#x641C;&#x7D22;&#x4F53;&#x9A8C;&#xFF0C;&#x5E76;&#x5B9E;&#x73B0;Html5&#x548C;APP&#x5185;&#x5BB9;&#x7684;&#x65E0;&#x7F1D;&#x6253;&#x901A;&#x3002;&#x8FD1;&#x5E74;&#x6765;&#x670D;&#x52A1;&#x7C7B;O2O&#x4EA7;&#x54C1;&#x5927;&#x91CF;&#x6D8C;&#x73B0;&#xFF0C;&#x767E;&#x5EA6;&#x5EFA;&#x8BAE;&#x53EA;&#x6709;APP&#x6216;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x53F7;&#x7684;&#x5546;&#x6237;&#x5C06;Html5&#x8D44;&#x6E90;&#x63D0;&#x4EA4;&#x7ED9;&#x767E;&#x5EA6;&#xFF0C;&#x5B9E;&#x73B0;&#x66F4;&#x597D;&#x7684;&#x6536;&#x76CA;&#x3002;      </p>
<p>&#x4F53;&#x9A8C;&#x63D0;&#x5347;&#xFF0C;&#x6807;&#x51C6;&#x5148;&#x884C;&#x3002;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x4F1A;&#x4F9D;&#x636E;&#x6B64;&#x6807;&#x51C6;&#x5728;&#x79FB;&#x52A8;&#x7AEF;&#x63A8;&#x51FA;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x7B97;&#x6CD5;&#xFF0C;&#x5C06;&#x79FB;&#x52A8;&#x53CB;&#x597D;&#x5EA6;&#x4F5C;&#x4E3A;&#x79FB;&#x52A8;&#x641C;&#x7D22;&#x6392;&#x540D;&#x7684;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x53C2;&#x8003;&#x56E0;&#x7D20;&#x3002;&#x540C;&#x65F6;&#x4F1A;&#x4E0D;&#x5B9A;&#x671F;&#x62BD;&#x6837;&#x79FB;&#x52A8;&#x9875;&#x8FDB;&#x884C;&#x4EBA;&#x5DE5;&#x8BC4;&#x4F30;&#xFF0C;&#x8BC4;&#x4F30;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x8FD4;&#x56DE;&#x6280;&#x672F;&#x90E8;&#x95E8;&#x8FDB;&#x884C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3002;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x4F1A;&#x7EE7;&#x7EED;&#x5B8C;&#x5584;&#x6807;&#x51C6;&#xFF0C;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x4E0D;&#x9057;&#x4F59;&#x529B;&#x5730;&#x63D0;&#x5347;&#x79FB;&#x52A8;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5E76;&#x66F4;&#x597D;&#x5730;&#x4E3A;&#x79FB;&#x52A8;&#x7AD9;&#x957F;&#x670D;&#x52A1;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="search-engine-principle.html" class="navigation navigation-prev " aria-label="Previous page: 百度搜索引擎工作原理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="website-optimization.html" class="navigation navigation-next " aria-label="Next page: 网站优化">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"百度搜索Mobile Friendly（移动友好度）标准V1.0","level":"4.1.2","depth":2,"next":{"title":"网站优化","level":"4.1.3","depth":2,"path":"seo/website-optimization.md","ref":"seo/website-optimization.md","articles":[]},"previous":{"title":"百度搜索引擎工作原理","level":"4.1.1","depth":2,"path":"seo/search-engine-principle.md","ref":"seo/search-engine-principle.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","atoc","-sharing","-lunr","-search","search-pro","baidu"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"baidu":{"token":"c7d52dcc025ace5582c34ce31e4b4552"},"splitter":{},"atoc":{},"search-pro":{},"highlight":{},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Web 开发手册","language":"zh-hans","gitbook":"*","description":"学习使用最新的 Web 技术，创建极速打开、信息安全、交互流畅的网页。"},"file":{"path":"seo/mobile-friendly-standard.md","mtime":"2017-07-31T07:22:54.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-07-31T08:29:02.100Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-atoc/atoc.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baidu/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

