
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>网站优化 · Web 开发手册</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-atoc/atoc.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="website-development.html" />
    
    
    <link rel="prev" href="mobile-friendly-standard.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    前端技术
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../web-tech/fis.html">
            
                <a href="../web-tech/fis.html">
            
                    
                    使用 FIS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../web-tech/use-mip-to-create-mobile-web-pages.html">
            
                <a href="../web-tech/use-mip-to-create-mobile-web-pages.html">
            
                    
                    MIP-移动页面加速器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="../web-tech/lavas-pwa.html">
            
                <a href="../web-tech/lavas-pwa.html">
            
                    
                    Lavas PWA-渐进式应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" >
            
                <span>
            
                    
                    建站安全
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1.1" data-path="../security/https-pratice-1.html">
            
                <a href="../security/https-pratice-1.html">
            
                    
                    大型网站的HTTPS实践（一）-- HTTPS协议和原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.2" data-path="../security/https-pratice-2.html">
            
                <a href="../security/https-pratice-2.html">
            
                    
                    大型网站的HTTPS实践（二）-- HTTPS对性能的影响
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.3" data-path="../security/https-pratice-3.html">
            
                <a href="../security/https-pratice-3.html">
            
                    
                    大型网站的HTTPS实践（三）-- 基于协议和配置的优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.4" data-path="../security/https-pratice-4.html">
            
                <a href="../security/https-pratice-4.html">
            
                    
                    大型网站的HTTPS实践（四）-- 协议层以外的实践[1]
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.5" data-path="../security/https-faq.html">
            
                <a href="../security/https-faq.html">
            
                    
                    HTTPS常见问题解答
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" >
            
                <span>
            
                    
                    SEO
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="4.1.1" data-path="search-engine-principle.html">
            
                <a href="search-engine-principle.html">
            
                    
                    百度搜索引擎工作原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.2" data-path="mobile-friendly-standard.html">
            
                <a href="mobile-friendly-standard.html">
            
                    
                    百度搜索Mobile Friendly（移动友好度）标准V1.0
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.1.3" data-path="website-optimization.html">
            
                <a href="website-optimization.html">
            
                    
                    网站优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.1.4" data-path="website-development.html">
            
                <a href="website-development.html">
            
                    
                    网站建设
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >网站优化</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7F51;&#x7AD9;&#x4F18;&#x5316;">&#x7F51;&#x7AD9;&#x4F18;&#x5316;</h1>
<h2 id="&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x4F18;&#x5316;&#x6CE8;&#x610F;&#x4E8B;&#x9879;">&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x4F18;&#x5316;&#x6CE8;&#x610F;&#x4E8B;&#x9879;</h2>
<p>&#x767E;&#x5EA6;&#x9700;&#x8981;&#x4F18;&#x8D28;&#x7AD9;&#x70B9;&#x4E3A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6570;&#x636E;&#x5E93;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x5730;&#x8F93;&#x5165;&#x7269;&#x6599;&#xFF0C;&#x540C;&#x65F6;&#x4F18;&#x8D28;&#x7AD9;&#x70B9;&#x4E5F;&#x9700;&#x8981;&#x4ECE;&#x767E;&#x5EA6;&#x83B7;&#x5F97;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7528;&#x6237;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E9B;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7528;&#x6237;&#x8F6C;&#x5316;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x7528;&#x6237;&#x3002;&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x53EF;&#x4EE5;&#x89C6;&#x4E3A;&#x4F18;&#x8D28;&#x7AD9;&#x70B9;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x662F;&#x6307;&#x5DF2;&#x7ECF;&#x6709;&#x8F83;&#x9AD8;&#x7528;&#x6237;&#x77E5;&#x540D;&#x5EA6;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x7AD9;&#x70B9;&#x8D8A;&#x662F;&#x77E5;&#x540D;&#xFF0C;&#x5C31;&#x8D8A;&#x5E94;&#x4ECE;&#x957F;&#x8FDC;&#x8003;&#x8651;&#xFF0C;&#x4EE5;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x4E3A;&#x91CD;&#xFF0C;&#x79EF;&#x6781;&#x3001;&#x5408;&#x7406;&#x7684;&#x8FDB;&#x884C;&#x7F51;&#x7AD9;&#x4F18;&#x5316;&#xFF0C;&#x8FDC;&#x79BB;&#x4F5C;&#x5F0A;&#x548C;&#x6076;&#x610F; SEO &#x884C;&#x4E3A;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E0E;&#x767E;&#x5EA6;&#x66F4;&#x52A0;&#x7A33;&#x56FA;&#x7684;&#x5408;&#x4F5C;&#x5173;&#x7CFB;&#x3002;          </p>
<p>&#x4F46;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x53EF;&#x4EE5;&#x9057;&#x61BE;&#x5730;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x4F7F;&#x7528;&#x4E86;&#x4E0D;&#x591F;&#x5408;&#x7406;&#x7684;&#x5185;&#x5BB9;&#x5EFA;&#x8BBE;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5927;&#x91CF;&#x4E0D;&#x540C;&#x5185;&#x5BB9;&#x7684;&#x9875;&#x9762;&#x5747;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x6807;&#x9898;&#xFF1B;&#x901A;&#x8FC7;&#x56FE;&#x7247;&#x7684;&#x65B9;&#x5F0F;&#x5C55;&#x73B0;&#x7F51;&#x9875;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF08;&#x65B0;&#x95FB;&#x3001;&#x8054;&#x7CFB;&#x7535;&#x8BDD;&#x7B49;&#xFF09;&#xFF1B;&#x91CD;&#x8981;&#x9875;&#x9762;&#x901A;&#x8FC7; flash &#x5EFA;&#x8BBE;&#xFF0C;&#x672A;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x8BF4;&#x660E;&#x7B49;&#x3002;     </p>
<p>&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x90FD;&#x4F1A;&#x4F7F;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5BF9;&#x7F51;&#x7AD9;&#x5185;&#x5BB9;&#x7684;&#x7406;&#x89E3;&#x9020;&#x6210;&#x56F0;&#x96BE;&#xFF0C;&#x6700;&#x7EC8;&#x5F71;&#x54CD;&#x7F51;&#x7AD9;&#x5728;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4E2D;&#x7684;&#x8868;&#x73B0;&#x3002;&#x6211;&#x4EEC;&#x5EFA;&#x8BAE;&#x60A8;&#x91C7;&#x53D6;&#x5BF9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x53CB;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#xFF0C;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x53EF;&#x53C2;&#x8003;&#x300A;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4F18;&#x5316;&#x6307;&#x5357;&#x300B;&#x4EE5;&#x53CA;&#x300A;&#x767E;&#x5EA6;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7F51;&#x9875;&#x8D28;&#x91CF;&#x767D;&#x76AE;&#x4E66;&#x300B;&#x3002;   </p>
<p>&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x5BF9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF0C;&#x4E43;&#x81F3;&#x6574;&#x4E2A;&#x4E92;&#x8054;&#x7F51;&#x6B22;&#x8FCE;&#x7684;&#x5F71;&#x54CD;&#x901A;&#x5E38;&#x662F;&#x5DE8;&#x5927;&#x7684;&#xFF0C;&#x82E5;&#x4F7F;&#x7528;&#x6076;&#x610F;&#x7684;&#x4F5C;&#x5F0A;&#x884C;&#x4E3A;&#xFF0C;&#x5176;&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x4E5F;&#x5C31;&#x8D8A;&#x574F;&#x3002;&#x4F8B;&#x5982;&#xFF1A; </p>
<ul>
<li>&#x51FA;&#x552E;&#x9996;&#x9875;&#x7684;&#x53CB;&#x60C5;&#x94FE;&#x63A5;&#x3002;</li>
<li>&#x5927;&#x91CF;&#x91C7;&#x96C6;&#x5176;&#x4ED6;&#x7F51;&#x7AD9;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x539F;&#x521B;&#x5185;&#x5BB9;&#x6BD4;&#x4F8B;&#x6781;&#x4F4E;&#xFF0C;&#x751A;&#x81F3;&#x5927;&#x91CF;&#x91C7;&#x96C6;&#x7F51;&#x7AD9;&#x4E3B;&#x9898;&#x65E0;&#x5173;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6216;&#x673A;&#x5668;&#x6279;&#x91CF;&#x751F;&#x6210;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x9875;&#x9762;&#x3002;</li>
<li>&#x7F51;&#x7AD9;&#x88AB;&#x5927;&#x91CF;&#x5E7F;&#x544A;&#x5185;&#x5BB9;&#x5360;&#x9886;&#x3002;</li>
</ul>
<p>&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x4E00;&#x65E6;&#x6709;&#x6076;&#x610F;&#x7684;&#x4F5C;&#x5F0A;&#x884C;&#x4E3A;&#xFF0C;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x6076;&#x52A3;&#x5F71;&#x54CD;&#x5C06;&#x662F;&#x5DE8;&#x5927;&#x7684;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x53D7;&#x5230;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x66F4;&#x4E3A;&#x4E25;&#x683C;&#x7684;&#x60E9;&#x7F5A;&#x3002;&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x66F4;&#x5E94;&#x4ECE;&#x957F;&#x8FDC;&#x8003;&#x8651;&#xFF0C;&#x63D0;&#x5347;&#x7528;&#x6237;&#x53E3;&#x7891;&#xFF0C;&#x7528;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x5185;&#x5BB9;&#x8D62;&#x5F97;&#x7528;&#x6237;&#x9752;&#x7750;&#x3002;&#x4E0D;&#x5E94;&#x4E3A;&#x4E86;&#x77ED;&#x671F;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x4E0D;&#x987E;&#x7528;&#x6237;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x505A;&#x6709;&#x635F;&#x54C1;&#x724C;&#x5F62;&#x8C61;&#x7684;&#x4E8B;&#x60C5;&#x3002;      </p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x77E5;&#x540D;&#x7AD9;&#x70B9;&#x4E5F;&#x662F;&#x5404;&#x8DEF;&#x4F5C;&#x5F0A;&#x8005;&#x7684; &#x201C;&#x4F17;&#x77E2;&#x4E4B;&#x7684;&#x201D;&#xFF0C;&#x5BB9;&#x6613;&#x88AB;&#x6076;&#x610F;&#x5229;&#x7528;&#x3002;&#x7AD9;&#x70B9;&#x8D8A;&#x77E5;&#x540D;&#xFF0C;&#x88AB;&#x5229;&#x7528;&#x7684;&#x4EF7;&#x503C;&#x5C31;&#x8D8A;&#x5927;&#x3002;&#x6211;&#x4EEC;&#x5EFA;&#x8BAE;&#x60A8;&#x5EFA;&#x7ACB;&#x9632;&#x8303;&#x610F;&#x8BC6;&#xFF0C;&#x907F;&#x514D;&#x7531;&#x4E8E;&#x88AB;&#x4F5C;&#x5F0A;&#x8005;&#x5229;&#x7528;&#x5F15;&#x8D77;&#x7684;&#x4E0D;&#x5FC5;&#x8981;&#x98CE;&#x9669;&#x3002;  </p>
<ul>
<li>&#x60A8;&#x7684;&#x7AD9;&#x70B9;&#x662F;&#x5426;&#x8DB3;&#x591F;&#x5B89;&#x5168;&#xFF1F;&#x5F53;&#x7F51;&#x7AD9;&#x88AB;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x65F6;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5E94;&#x5BF9;&#x673A;&#x5236;&#xFF1F;</li>
<li>&#x7531;&#x7528;&#x6237;&#x8D21;&#x732E;&#x5185;&#x5BB9;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x662F;&#x5426;&#x505A;&#x597D;&#x4E86;&#x5E94;&#x5BF9;&#x4F5C;&#x5F0A;&#x7684;&#x63AA;&#x65BD;&#xFF1F;</li>
<li>&#x5BF9;&#x4E8E;&#x4E0D;&#x60F3;&#x8BA9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6536;&#x5F55;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x662F;&#x5426;&#x5728; robot.txt &#x4E2D;&#x6E05;&#x6670;&#x6307;&#x660E;&#xFF1F;</li>
</ul>
<h2 id="&#x767E;&#x5EA6;&#x7D22;&#x5F15;&#x91CF;&#x53D8;&#x5316;&#x8FFD;&#x67E5;&#x6295;&#x8BC9;&#x65B9;&#x6CD5;">&#x767E;&#x5EA6;&#x7D22;&#x5F15;&#x91CF;&#x53D8;&#x5316;&#x8FFD;&#x67E5;&#x6295;&#x8BC9;&#x65B9;&#x6CD5;</h2>
<p>&#x76F8;&#x4FE1;&#x65E0;&#x8BBA;&#x7AD9;&#x70B9;&#x77E5;&#x540D;&#xFF0C;&#x90FD;&#x5BF9;&#x767E;&#x5EA6;&#x7D22;&#x5F15;&#x91CF;&#x6570;&#x636E;&#x975E;&#x5E38;&#x654F;&#x611F;&#xFF0C;&#x6BD5;&#x7ADF;&#x7D22;&#x5F15;&#x91CF;&#xFF08;&#x6216;&#x79F0;&#x6536;&#x5F55;&#x91CF;&#xFF09;&#x5C5E;&#x4E8E;&#x7F51;&#x7AD9;&#x6D41;&#x91CF;&#x7684;&#x57FA;&#x77F3;&#xFF0C;&#x76EF;&#x7740;&#x767E;&#x5EA6;&#x7AD9;&#x957F;&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x7684;&#x7D22;&#x5F15;&#x91CF;&#x5DE5;&#x5177;&#x67E5;&#x770B;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x662F;&#x5F88;&#x591A;&#x7AD9;&#x957F;&#x6BCF;&#x5929;&#x7684;&#x4F8B;&#x884C;&#x5DE5;&#x4F5C;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x8BF4;&#xFF0C;&#x7D22;&#x5F15;&#x91CF;&#x53D1;&#x751F;&#x6CE2;&#x52A8;&#x5C5E;&#x4E8E;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x5E94;&#x6389;&#x4EE5;&#x8F7B;&#x5FC3;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x6D41;&#x7A0B;&#x56FE;&#x6765;&#x8FDB;&#x884C;&#x95EE;&#x9898;&#x6392;&#x67E5;&#x3002;   </p>
<p><img src="img/2.jpg" alt=""></p>
<p>&#x5173;&#x4E8E;&#x7533;&#x8BC9;&#xFF0C;&#x9664;&#x4E86;&#x518D;&#x4E00;&#x6B21;&#x64AD;&#x62A5;&#x7533;&#x8BC9;&#x5730;&#x5740;&#xFF08;<a href="http://zhanzhang.baidu.com/feedback" target="_blank">http://zhanzhang.baidu.com/feedback</a>&#xFF09;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x5404;&#x4F4D;&#x7AD9;&#x957F;&#x63D0;&#x4E2A;&#x9192;&#xFF0C;&#x5728;&#x64B0;&#x5199;&#x7533;&#x8BC9;&#x5185;&#x5BB9;&#x65F6;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x5C06;&#x95EE;&#x9898;&#x63CF;&#x8FF0;&#x5177;&#x4F53;&#xFF0C;&#x5F15;&#x7528;&#x7F51;&#x53CB;&#x7684;&#x7ECF;&#x9A8C;&#xFF1A;&#x201C;&#x7F51;&#x7AD9;&#x7D22;&#x5F15;&#x91CF;&#x5F02;&#x5E38;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x767E;&#x5EA6;&#x7AD9;&#x957F;&#x5E73;&#x53F0;&#x7684;&#x7D22;&#x5F15;&#x91CF;&#x67E5;&#x8BE2;&#x5DE5;&#x5177;&#xFF0C;&#x4E00;&#x7EA7;&#x4E00;&#x7EA7;&#x7684;&#x904D;&#x5386;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7F51;&#x7AD9;&#x7684;&#x4E3B;&#x8981;&#x5B50;&#x57DF;&#x540D;&#x6216;&#x76EE;&#x5F55;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x4E2A;&#x5B50;&#x57DF;&#x540D;&#x6216;&#x76EE;&#x5F55;&#x7684;&#x7D22;&#x5F15;&#x91CF;&#x51FA;&#x73B0;&#x4E86;&#x5F02;&#x5E38;&#x3002;&#x201D;&#x201C;&#x6BCF;&#x4E2A;&#x9891;&#x9053;&#x9009;&#x53D6;&#x4E00;&#x4E9B;&#x9875;&#x9762;&#xFF0C;&#x5728;&#x767E;&#x5EA6;&#x7F51;&#x9875;&#x641C;&#x7D22;&#x4E2D;&#x76F4;&#x63A5;&#x641C;&#x7D22;&#x8FD9;&#x6837;&#x9875;&#x9762;&#x7684; URL&#xFF0C;&#x4EE5;&#x5B9A;&#x4F4D;&#x88AB;&#x5220;&#x9664;&#x5FEB;&#x7167;&#x7F51;&#x9875;&#x7684;&#x6700;&#x5C0F;&#x8303;&#x56F4;&#x3002;&#x201D;&#x201C;&#x7136;&#x540E;&#x5728;&#x6295;&#x8BC9;&#x5185;&#x5BB9;&#x4E2D;&#x660E;&#x786E;&#x7ED9;&#x51FA; &apos;&#x75C5;&#x4F53;&apos; &#x7684; URL&#xFF0C;&#x5E76;&#x9644;&#x4E0A;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x53D8;&#x52A8;&#x622A;&#x56FE;&#x3002;&#x201D; &#x8FD9;&#x6837;&#x624D;&#x4FBF;&#x4E8E;&#x5904;&#x7406;&#x6295;&#x8BC9;&#x7684;&#x767E;&#x5EA6;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#x5FEB;&#x901F;&#x5BFB;&#x627E;&#x95EE;&#x9898;&#x75C7;&#x7ED3;&#x3002;       </p>
<p>&#x53E6;&#x5916;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x7AD9;&#x957F;&#x4EEC;&#x5F80;&#x5F80;&#x53EA;&#x6709;&#x5728;&#x7D22;&#x5F15;&#x91CF;&#x4E0B;&#x964D;&#x65F6;&#x5FC3;&#x60CA;&#x8089;&#x8DF3;&#x4E00;&#x628A;&#xFF0C;&#x5728;&#x767E;&#x5EA6;&#x5185;&#x90E8;&#x4EBA;&#x5458;&#x770B;&#x6765;&#xFF0C;&#x7D22;&#x5F15;&#x91CF;&#x65E0;&#x7F18;&#x65E0;&#x6545;&#x5927;&#x5E45;&#x589E;&#x957F;&#x66F4;&#x5E94;&#x8BE5;&#x8B66;&#x60D5;&#xFF0C;&#x5E94;&#x8BE5;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#xFF1A;   </p>
<ul>
<li>&#x4F1A;&#x4E0D;&#x4F1A;&#x662F;&#x7F51;&#x7AD9;&#x88AB;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x540E;&#x589E;&#x52A0;&#x4E86;&#x5927;&#x91CF;&#x5783;&#x573E;&#x7F51;&#x9875;</li>
<li>&#x4F1A;&#x4E0D;&#x4F1A;&#x662F; Robost &#x534F;&#x8BAE;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5BFC;&#x81F4;&#x5927;&#x6279;&#x4FDD;&#x5BC6;&#x9875;&#x9762;&#x88AB;&#x767E;&#x5EA6;&#x6293;&#x53D6;</li>
<li>&#x5927;&#x5E45;&#x589E;&#x52A0;&#x7684; url &#x4F1A;&#x4E0D;&#x4F1A;&#x5360;&#x7528;&#x6709;&#x9650;&#x7684;&#x6293;&#x53D6;&#x914D;&#x989D;&#xFF0C;&#x5BFC;&#x81F4;&#x91CD;&#x8981;&#x4F18;&#x8D28;&#x5185;&#x5BB9;&#x672A;&#x88AB;&#x6293;&#x53D6;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="mobile-friendly-standard.html" class="navigation navigation-prev " aria-label="Previous page: 百度搜索Mobile Friendly（移动友好度）标准V1.0">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="website-development.html" class="navigation navigation-next " aria-label="Next page: 网站建设">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"网站优化","level":"4.1.3","depth":2,"next":{"title":"网站建设","level":"4.1.4","depth":2,"path":"seo/website-development.md","ref":"seo/website-development.md","articles":[]},"previous":{"title":"百度搜索Mobile Friendly（移动友好度）标准V1.0","level":"4.1.2","depth":2,"path":"seo/mobile-friendly-standard.md","ref":"seo/mobile-friendly-standard.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","atoc","-sharing","-lunr","-search","search-pro","baidu"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"baidu":{"token":"c7d52dcc025ace5582c34ce31e4b4552"},"splitter":{},"atoc":{},"search-pro":{},"highlight":{},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Web 开发手册","language":"zh-hans","gitbook":"*","description":"学习使用最新的 Web 技术，创建极速打开、信息安全、交互流畅的网页。"},"file":{"path":"seo/website-optimization.md","mtime":"2017-07-31T08:07:46.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-07-31T08:29:02.100Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-atoc/atoc.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-baidu/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

